Tekla Open API Reference for Tekla Structures 2025
ShapeSelectionForm Class
 The ShapeSelectionForm class represents a dialog to select Shapes using the Shape catalogs.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.UIControls.ShapeSelectionForm
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ShapeSelectionForm : Form
Public Class ShapeSelectionForm
	Inherits Form
The ShapeSelectionForm type exposes the following members.
Constructors
Name | Description
ShapeSelectionForm(List<ShapeItem>)
 Initializes a new instance of the ShapeSelectionForm class.
ShapeSelectionForm(List<ShapeItem>, String)
 Initializes a new instance of the ShapeSelectionForm class, selecting the given Shape in the tree control.
Top
Properties
Name | Description
SelectedShape
 Gets or sets the selected Shape in the control.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace